Repository: CJWorkbench/xpathextractor
Catalog: locale/*/messages.po
Languages: el

# _spec.name
source: HTML to table
el: Από HTML σε πίνακα

# _spec.description
source: Extract a table from HTML text using <table> tags or xpath selectors.
el: Εξαγωγή πίνακα από κείμενο HTML χρησιμοποιώντας ετικέτες <table> ή επιλογείς XPath.

# _spec.parameters.method.name
source: Method
el: Μέθοδος

# _spec.parameters.method.options.table.label
source: <table> tags
el: Ετικέτες <table>

# _spec.parameters.method.options.xpath.label
source: Xpath selectors
el: Επιλογείς XPath

# _spec.parameters.tablenum.name
source: Which table on this page?
el: Ποιος πίνακας σε αυτή τη σελίδα;

# _spec.parameters.colselectors.child_parameters.colxpath.name
source: XPath selector
el: Επιλογέας XPath

# _spec.parameters.colselectors.child_parameters.colxpath.placeholder
source: Enter xpath selector
el: Εισαγάγετε τον επιλογέα XPath

# _spec.parameters.colselectors.child_parameters.colname.name
source: Column name
el: Όνομα στήλης

# _spec.parameters.colselectors.child_parameters.colname.placeholder
source: Enter column name
el: Πληκτρολογήστε το όνομα στήλης

# ColumnExtractionError.message
source: XPath error for column "{column_name}": {error}
el: Σφάλμα XPath για τη στήλη "{column_name}": {error}

# badParam.colname.missing
source: Missing column name
el: Λείπει το όνομα της στήλης

# badParam.colname.duplicate
source: Duplicate column name "{column_name}"
el: Διπλό όνομα στήλης "{column_name}"

# badParam.colxpath.missing
source: Missing column selector
el: Λείπει ο επιλογέας στήλης

# badParam.colxpath.invalid
source: Invalid XPath syntax for column "{column_name}": {error}
el: Μη έγκυρη σύνταξη XPath για τη στήλη "{column_name}": {error}

# warning.extractedDifferentLengths
source: Extracted columns of differing lengths from HTML on row {row}
el: Έχει γίνει εξαγωγή στηλών διαφορετικού μήκους από το HTML της σειράς {row}

# error.noTable
source: Did not find any <table> tags in {rowname}
el: Δεν βρέθηκαν ετικέτες <table> στη σειρά {rowname}

# error.noColumn
source: Table has no columns in {rowname}
el: Ο πίνακας δεν έχει στήλες στη σειρά {rowname}

# badParam.tableNum.tooBig
source: The maximum table number is {len_tables} for {rowname}
el: Ο μέγιστος αριθμός πίνακα είναι {len_tables} για τη σειρά {rowname}

# badParam.tablenum.negative
source: Table number must be at least 1
el: Ο αριθμός πίνακα πρέπει να είναι τουλάχιστον 1

# error.noHtml.error
source: No 'html' column found. Do you need to scrape?
el: Δεν βρέθηκε στήλη "html". Χρειάζεται να τη συλλέξεις από κάπου;

# error.noHtml.quick_fix.text
source: Add HTML scraper
el: Προσθέστε Συλλέκτη HTML
